app/views/home/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]
---
    <p class="article-text"> <%= truncate(@most_voted_article.text, length:100, separator: ' ') %> </p>
    <span class="vote-white">  <%= @most_voted_article.votes.size %> <%= vote_or_unvote(@most_voted_article, 'vote-white') %></span>

SELECT  "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]
---
    <%  @categories.ordered_by_priority.each do |category| %>
    <% if category.articles.size > 0 %>
    <div class="col-lg-3 col-md-6 col-sm-6 p-0">
      <div class="category-post"  style="background:url(<%= category.articles.ordered_most_recent.first.image %>)">
        <h5> <%= link_to(category.name, category_path(category), :class => 'category-name m-4')%> </h5>
        <p class="article-title-category bottom-left m-4"><%= category.articles.ordered_most_recent.first.title %></p>