app/helpers/vote_helper.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 7]]
---
  def most_voted_article
    articles = Article.all
    best_count = 0
    best_article = Article.all.first
    articles.each do |article|
      if article.votes.size > best_count
        best_article = article
        best_count = article.votes.size

SELECT  "votes".* FROM "votes" WHERE "votes"."article_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["article_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
  def vote_or_unvote(article, style = 'label-form')
    if logged_in?
      vote = Vote.find_by(article: article, user: current_user)