app/controllers/articles_controller.rb

  def new
    @article = Article.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @categories = Category.all
    @user = current_user
    @article = @user.articles.new(post_params)

    if @article.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "articles" ("user_id", "title", "text", "created_at", "updated_at", "category_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?)