app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
---
  def show
    @category = Category.find(params[:id])
    @articles = @category.articles.ordered_most_recent

INSERT INTO "categories" ("name", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mouse"], ["priority", 5], ["created_at", "2020-06-03 19:18:54.250148"], ["updated_at", "2020-06-03 19:18:54.250148"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save