app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Shubham"], ["created_at", "2020-06-03 19:18:41.204028"], ["updated_at", "2020-06-03 19:18:41.204028"]]