app/controllers/votes_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["article_id", 9], ["created_at", "2020-06-03 19:36:07.133835"], ["updated_at", "2020-06-03 19:36:07.133835"]]
---
  def create
    @vote = current_user.votes.new(article_id: params[:article_id])
    @category = Article.find_by(id: params[:article_id]).category
    if @vote.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? AND "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["id", 1], ["user_id", 2], ["article_id", 9], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
---
  def destroy
    @category = Article.find_by(id: params[:article_id]).category
    vote = Vote.find_by(id: params[:id], user: current_user, article_id: params[:article_id])
    if vote
      vote.destroy