app/views/categories/show.html.erb

            <div class="col-4 text-rigth">
              <span class="label-form">  <%= article.votes.size %> <%= vote_or_unvote(article) %></span>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 2]]